MikroElektronika/core_packages/PIC/XC8/def/PIC16F19195/mcu.h
extern volatile ALRMDAYbits_t ALRMDAYbits __at(0xC19);
// bitfield macros
#define _ALRMDAY_ALRMLDAY_POSN                              0x0
#define _ALRMDAY_ALRMLDAY_POSITION                          0x0
#define _ALRMDAY_ALRMLDAY_SIZE                              0x4
#define _ALRMDAY_ALRMLDAY_LENGTH                            0x4
#define _ALRMDAY_ALRMLDAY_MASK                              0xF
#define _ALRMDAY_ALRMHDAY_POSN                              0x4
#define _ALRMDAY_ALRMHDAY_POSITION                          0x4
#define _ALRMDAY_ALRMHDAY_SIZE                              0x2
#define _ALRMDAY_ALRMHDAY_LENGTH                            0x2
#define _ALRMDAY_ALRMHDAY_MASK                              0x30
#define _ALRMDAY_ALRMLDAY0_POSN                             0x0
#define _ALRMDAY_ALRMLDAY0_POSITION                         0x0
#define _ALRMDAY_ALRMLDAY0_SIZE                             0x1
#define _ALRMDAY_ALRMLDAY0_LENGTH                           0x1
#define _ALRMDAY_ALRMLDAY0_MASK                             0x1
#define _ALRMDAY_ALRMLDAY1_POSN                             0x1
#define _ALRMDAY_ALRMLDAY1_POSITION                         0x1
#define _ALRMDAY_ALRMLDAY1_SIZE                             0x1
#define _ALRMDAY_ALRMLDAY1_LENGTH                           0x1
#define _ALRMDAY_ALRMLDAY1_MASK                             0x2
#define _ALRMDAY_ALRMLDAY2_POSN                             0x2
#define _ALRMDAY_ALRMLDAY2_POSITION                         0x2
#define _ALRMDAY_ALRMLDAY2_SIZE                             0x1
#define _ALRMDAY_ALRMLDAY2_LENGTH                           0x1
#define _ALRMDAY_ALRMLDAY2_MASK                             0x4
#define _ALRMDAY_ALRMLDAY3_POSN                             0x3
#define _ALRMDAY_ALRMLDAY3_POSITION                         0x3
#define _ALRMDAY_ALRMLDAY3_SIZE                             0x1
#define _ALRMDAY_ALRMLDAY3_LENGTH                           0x1
#define _ALRMDAY_ALRMLDAY3_MASK                             0x8
#define _ALRMDAY_ALRMHDAY0_POSN                             0x4
#define _ALRMDAY_ALRMHDAY0_POSITION                         0x4
#define _ALRMDAY_ALRMHDAY0_SIZE                             0x1
#define _ALRMDAY_ALRMHDAY0_LENGTH                           0x1
#define _ALRMDAY_ALRMHDAY0_MASK                             0x10
#define _ALRMDAY_ALRMHDAY1_POSN                             0x5
#define _ALRMDAY_ALRMHDAY1_POSITION                         0x5
#define _ALRMDAY_ALRMHDAY1_SIZE                             0x1
#define _ALRMDAY_ALRMHDAY1_LENGTH                           0x1
#define _ALRMDAY_ALRMHDAY1_MASK                             0x20

// Register: ALRMHR
#define ALRMHR ALRMHR
extern volatile unsigned char           ALRMHR              __at(0xC1A);
#ifndef _LIB_BUILD
asm("ALRMHR equ 0C1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ALRMLHR                :4;
        unsigned ALRMHHR                :2;
    };
    struct {
        unsigned ALRMLHR0               :1;
        unsigned ALRMLHR1               :1;
        unsigned ALRMLHR2               :1;
        unsigned ALRMLHR3               :1;
        unsigned ALRMHHR0               :1;
        unsigned ALRMHHR1               :1;
    };
} ALRMHRbits_t;
extern volatile ALRMHRbits_t ALRMHRbits __at(0xC1A);
// bitfield macros
#define _ALRMHR_ALRMLHR_POSN                                0x0
#define _ALRMHR_ALRMLHR_POSITION                            0x0
#define _ALRMHR_ALRMLHR_SIZE                                0x4
#define _ALRMHR_ALRMLHR_LENGTH                              0x4
#define _ALRMHR_ALRMLHR_MASK                                0xF
#define _ALRMHR_ALRMHHR_POSN                                0x4
#define _ALRMHR_ALRMHHR_POSITION                            0x4
#define _ALRMHR_ALRMHHR_SIZE                                0x2
#define _ALRMHR_ALRMHHR_LENGTH                              0x2
#define _ALRMHR_ALRMHHR_MASK                                0x30
#define _ALRMHR_ALRMLHR0_POSN                               0x0
#define _ALRMHR_ALRMLHR0_POSITION                           0x0
#define _ALRMHR_ALRMLHR0_SIZE                               0x1
#define _ALRMHR_ALRMLHR0_LENGTH                             0x1
#define _ALRMHR_ALRMLHR0_MASK                               0x1
#define _ALRMHR_ALRMLHR1_POSN                               0x1
#define _ALRMHR_ALRMLHR1_POSITION                           0x1
#define _ALRMHR_ALRMLHR1_SIZE                               0x1
#define _ALRMHR_ALRMLHR1_LENGTH                             0x1
#define _ALRMHR_ALRMLHR1_MASK                               0x2
#define _ALRMHR_ALRMLHR2_POSN                               0x2
#define _ALRMHR_ALRMLHR2_POSITION                           0x2
#define _ALRMHR_ALRMLHR2_SIZE                               0x1
#define _ALRMHR_ALRMLHR2_LENGTH                             0x1
#define _ALRMHR_ALRMLHR2_MASK                               0x4
#define _ALRMHR_ALRMLHR3_POSN                               0x3
#define _ALRMHR_ALRMLHR3_POSITION                           0x3
#define _ALRMHR_ALRMLHR3_SIZE                               0x1
#define _ALRMHR_ALRMLHR3_LENGTH                             0x1
#define _ALRMHR_ALRMLHR3_MASK                               0x8
#define _ALRMHR_ALRMHHR0_POSN                               0x4
#define _ALRMHR_ALRMHHR0_POSITION                           0x4
#define _ALRMHR_ALRMHHR0_SIZE                               0x1
#define _ALRMHR_ALRMHHR0_LENGTH                             0x1
#define _ALRMHR_ALRMHHR0_MASK                               0x10
#define _ALRMHR_ALRMHHR1_POSN                               0x5
#define _ALRMHR_ALRMHHR1_POSITION                           0x5
#define _ALRMHR_ALRMHHR1_SIZE                               0x1
#define _ALRMHR_ALRMHHR1_LENGTH                             0x1
#define _ALRMHR_ALRMHHR1_MASK                               0x20

// Register: ALRMMIN
#define ALRMMIN ALRMMIN
extern volatile unsigned char           ALRMMIN             __at(0xC1B);
#ifndef _LIB_BUILD
asm("ALRMMIN equ 0C1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ALRMLMIN               :4;
        unsigned ALRMHMIN               :3;
    };
    struct {
        unsigned ALRMLMIN0              :1;
        unsigned ALRMLMIN1              :1;
        unsigned ALRMLMIN2              :1;
        unsigned ALRMLMIN3              :1;
        unsigned ALRMHMIN0              :1;
        unsigned ALRMHMIN1              :1;
        unsigned ALRMHMIN2              :1;
    };
} ALRMMINbits_t;
extern volatile ALRMMINbits_t ALRMMINbits __at(0xC1B);
// bitfield macros
#define _ALRMMIN_ALRMLMIN_POSN                              0x0
#define _ALRMMIN_ALRMLMIN_POSITION                          0x0
#define _ALRMMIN_ALRMLMIN_SIZE                              0x4
#define _ALRMMIN_ALRMLMIN_LENGTH                            0x4
#define _ALRMMIN_ALRMLMIN_MASK                              0xF
#define _ALRMMIN_ALRMHMIN_POSN                              0x4
#define _ALRMMIN_ALRMHMIN_POSITION                          0x4
#define _ALRMMIN_ALRMHMIN_SIZE                              0x3
#define _ALRMMIN_ALRMHMIN_LENGTH                            0x3
#define _ALRMMIN_ALRMHMIN_MASK                              0x70
#define _ALRMMIN_ALRMLMIN0_POSN                             0x0
#define _ALRMMIN_ALRMLMIN0_POSITION                         0x0
#define _ALRMMIN_ALRMLMIN0_SIZE                             0x1
#define _ALRMMIN_ALRMLMIN0_LENGTH                           0x1
#define _ALRMMIN_ALRMLMIN0_MASK                             0x1
#define _ALRMMIN_ALRMLMIN1_POSN                             0x1
#define _ALRMMIN_ALRMLMIN1_POSITION                         0x1
#define _ALRMMIN_ALRMLMIN1_SIZE                             0x1
#define _ALRMMIN_ALRMLMIN1_LENGTH                           0x1
#define _ALRMMIN_ALRMLMIN1_MASK                             0x2
#define _ALRMMIN_ALRMLMIN2_POSN                             0x2
#define _ALRMMIN_ALRMLMIN2_POSITION                         0x2
#define _ALRMMIN_ALRMLMIN2_SIZE                             0x1
#define _ALRMMIN_ALRMLMIN2_LENGTH                           0x1
#define _ALRMMIN_ALRMLMIN2_MASK                             0x4
#define _ALRMMIN_ALRMLMIN3_POSN                             0x3
#define _ALRMMIN_ALRMLMIN3_POSITION                         0x3
#define _ALRMMIN_ALRMLMIN3_SIZE                             0x1
#define _ALRMMIN_ALRMLMIN3_LENGTH                           0x1
#define _ALRMMIN_ALRMLMIN3_MASK                             0x8
#define _ALRMMIN_ALRMHMIN0_POSN                             0x4
#define _ALRMMIN_ALRMHMIN0_POSITION                         0x4
#define _ALRMMIN_ALRMHMIN0_SIZE                             0x1
#define _ALRMMIN_ALRMHMIN0_LENGTH                           0x1
#define _ALRMMIN_ALRMHMIN0_MASK                             0x10
#define _ALRMMIN_ALRMHMIN1_POSN                             0x5
#define _ALRMMIN_ALRMHMIN1_POSITION                         0x5
#define _ALRMMIN_ALRMHMIN1_SIZE                             0x1
#define _ALRMMIN_ALRMHMIN1_LENGTH                           0x1
#define _ALRMMIN_ALRMHMIN1_MASK                             0x20
#define _ALRMMIN_ALRMHMIN2_POSN                             0x6
#define _ALRMMIN_ALRMHMIN2_POSITION                         0x6
#define _ALRMMIN_ALRMHMIN2_SIZE                             0x1
#define _ALRMMIN_ALRMHMIN2_LENGTH                           0x1
#define _ALRMMIN_ALRMHMIN2_MASK                             0x40

