MikroElektronika/core_packages/PIC/XC8/def/PIC16F19195/mcu.h
extern volatile RD4PPSbits_t RD4PPSbits __at(0x1F2C);
// bitfield macros
#define _RD4PPS_RD4PPS0_POSN                                0x0
#define _RD4PPS_RD4PPS0_POSITION                            0x0
#define _RD4PPS_RD4PPS0_SIZE                                0x1
#define _RD4PPS_RD4PPS0_LENGTH                              0x1
#define _RD4PPS_RD4PPS0_MASK                                0x1
#define _RD4PPS_RD4PPS1_POSN                                0x1
#define _RD4PPS_RD4PPS1_POSITION                            0x1
#define _RD4PPS_RD4PPS1_SIZE                                0x1
#define _RD4PPS_RD4PPS1_LENGTH                              0x1
#define _RD4PPS_RD4PPS1_MASK                                0x2
#define _RD4PPS_RD4PPS2_POSN                                0x2
#define _RD4PPS_RD4PPS2_POSITION                            0x2
#define _RD4PPS_RD4PPS2_SIZE                                0x1
#define _RD4PPS_RD4PPS2_LENGTH                              0x1
#define _RD4PPS_RD4PPS2_MASK                                0x4
#define _RD4PPS_RD4PPS3_POSN                                0x3
#define _RD4PPS_RD4PPS3_POSITION                            0x3
#define _RD4PPS_RD4PPS3_SIZE                                0x1
#define _RD4PPS_RD4PPS3_LENGTH                              0x1
#define _RD4PPS_RD4PPS3_MASK                                0x8
#define _RD4PPS_RD4PPS4_POSN                                0x4
#define _RD4PPS_RD4PPS4_POSITION                            0x4
#define _RD4PPS_RD4PPS4_SIZE                                0x1
#define _RD4PPS_RD4PPS4_LENGTH                              0x1
#define _RD4PPS_RD4PPS4_MASK                                0x10
#define _RD4PPS_RD4PPS5_POSN                                0x5
#define _RD4PPS_RD4PPS5_POSITION                            0x5
#define _RD4PPS_RD4PPS5_SIZE                                0x1
#define _RD4PPS_RD4PPS5_LENGTH                              0x1
#define _RD4PPS_RD4PPS5_MASK                                0x20

// Register: RD5PPS
#define RD5PPS RD5PPS
extern volatile unsigned char           RD5PPS              __at(0x1F2D);
#ifndef _LIB_BUILD
asm("RD5PPS equ 01F2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD5PPS0                :1;
        unsigned RD5PPS1                :1;
        unsigned RD5PPS2                :1;
        unsigned RD5PPS3                :1;
        unsigned RD5PPS4                :1;
        unsigned RD5PPS5                :1;
    };
} RD5PPSbits_t;
extern volatile RD5PPSbits_t RD5PPSbits __at(0x1F2D);
// bitfield macros
#define _RD5PPS_RD5PPS0_POSN                                0x0
#define _RD5PPS_RD5PPS0_POSITION                            0x0
#define _RD5PPS_RD5PPS0_SIZE                                0x1
#define _RD5PPS_RD5PPS0_LENGTH                              0x1
#define _RD5PPS_RD5PPS0_MASK                                0x1
#define _RD5PPS_RD5PPS1_POSN                                0x1
#define _RD5PPS_RD5PPS1_POSITION                            0x1
#define _RD5PPS_RD5PPS1_SIZE                                0x1
#define _RD5PPS_RD5PPS1_LENGTH                              0x1
#define _RD5PPS_RD5PPS1_MASK                                0x2
#define _RD5PPS_RD5PPS2_POSN                                0x2
#define _RD5PPS_RD5PPS2_POSITION                            0x2
#define _RD5PPS_RD5PPS2_SIZE                                0x1
#define _RD5PPS_RD5PPS2_LENGTH                              0x1
#define _RD5PPS_RD5PPS2_MASK                                0x4
#define _RD5PPS_RD5PPS3_POSN                                0x3
#define _RD5PPS_RD5PPS3_POSITION                            0x3
#define _RD5PPS_RD5PPS3_SIZE                                0x1
#define _RD5PPS_RD5PPS3_LENGTH                              0x1
#define _RD5PPS_RD5PPS3_MASK                                0x8
#define _RD5PPS_RD5PPS4_POSN                                0x4
#define _RD5PPS_RD5PPS4_POSITION                            0x4
#define _RD5PPS_RD5PPS4_SIZE                                0x1
#define _RD5PPS_RD5PPS4_LENGTH                              0x1
#define _RD5PPS_RD5PPS4_MASK                                0x10
#define _RD5PPS_RD5PPS5_POSN                                0x5
#define _RD5PPS_RD5PPS5_POSITION                            0x5
#define _RD5PPS_RD5PPS5_SIZE                                0x1
#define _RD5PPS_RD5PPS5_LENGTH                              0x1
#define _RD5PPS_RD5PPS5_MASK                                0x20

// Register: RD6PPS
#define RD6PPS RD6PPS
extern volatile unsigned char           RD6PPS              __at(0x1F2E);
#ifndef _LIB_BUILD
asm("RD6PPS equ 01F2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD6PPS0                :1;
        unsigned RD6PPS1                :1;
        unsigned RD6PPS2                :1;
        unsigned RD6PPS3                :1;
        unsigned RD6PPS4                :1;
        unsigned RD6PPS5                :1;
    };
} RD6PPSbits_t;
extern volatile RD6PPSbits_t RD6PPSbits __at(0x1F2E);
// bitfield macros
#define _RD6PPS_RD6PPS0_POSN                                0x0
#define _RD6PPS_RD6PPS0_POSITION                            0x0
#define _RD6PPS_RD6PPS0_SIZE                                0x1
#define _RD6PPS_RD6PPS0_LENGTH                              0x1
#define _RD6PPS_RD6PPS0_MASK                                0x1
#define _RD6PPS_RD6PPS1_POSN                                0x1
#define _RD6PPS_RD6PPS1_POSITION                            0x1
#define _RD6PPS_RD6PPS1_SIZE                                0x1
#define _RD6PPS_RD6PPS1_LENGTH                              0x1
#define _RD6PPS_RD6PPS1_MASK                                0x2
#define _RD6PPS_RD6PPS2_POSN                                0x2
#define _RD6PPS_RD6PPS2_POSITION                            0x2
#define _RD6PPS_RD6PPS2_SIZE                                0x1
#define _RD6PPS_RD6PPS2_LENGTH                              0x1
#define _RD6PPS_RD6PPS2_MASK                                0x4
#define _RD6PPS_RD6PPS3_POSN                                0x3
#define _RD6PPS_RD6PPS3_POSITION                            0x3
#define _RD6PPS_RD6PPS3_SIZE                                0x1
#define _RD6PPS_RD6PPS3_LENGTH                              0x1
#define _RD6PPS_RD6PPS3_MASK                                0x8
#define _RD6PPS_RD6PPS4_POSN                                0x4
#define _RD6PPS_RD6PPS4_POSITION                            0x4
#define _RD6PPS_RD6PPS4_SIZE                                0x1
#define _RD6PPS_RD6PPS4_LENGTH                              0x1
#define _RD6PPS_RD6PPS4_MASK                                0x10
#define _RD6PPS_RD6PPS5_POSN                                0x5
#define _RD6PPS_RD6PPS5_POSITION                            0x5
#define _RD6PPS_RD6PPS5_SIZE                                0x1
#define _RD6PPS_RD6PPS5_LENGTH                              0x1
#define _RD6PPS_RD6PPS5_MASK                                0x20

// Register: RD7PPS
#define RD7PPS RD7PPS
extern volatile unsigned char           RD7PPS              __at(0x1F2F);
#ifndef _LIB_BUILD
asm("RD7PPS equ 01F2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD7PPS0                :1;
        unsigned RD7PPS1                :1;
        unsigned RD7PPS2                :1;
        unsigned RD7PPS3                :1;
        unsigned RD7PPS4                :1;
        unsigned RD7PPS5                :1;
    };
} RD7PPSbits_t;
extern volatile RD7PPSbits_t RD7PPSbits __at(0x1F2F);
// bitfield macros
#define _RD7PPS_RD7PPS0_POSN                                0x0
#define _RD7PPS_RD7PPS0_POSITION                            0x0
#define _RD7PPS_RD7PPS0_SIZE                                0x1
#define _RD7PPS_RD7PPS0_LENGTH                              0x1
#define _RD7PPS_RD7PPS0_MASK                                0x1
#define _RD7PPS_RD7PPS1_POSN                                0x1
#define _RD7PPS_RD7PPS1_POSITION                            0x1
#define _RD7PPS_RD7PPS1_SIZE                                0x1
#define _RD7PPS_RD7PPS1_LENGTH                              0x1
#define _RD7PPS_RD7PPS1_MASK                                0x2
#define _RD7PPS_RD7PPS2_POSN                                0x2
#define _RD7PPS_RD7PPS2_POSITION                            0x2
#define _RD7PPS_RD7PPS2_SIZE                                0x1
#define _RD7PPS_RD7PPS2_LENGTH                              0x1
#define _RD7PPS_RD7PPS2_MASK                                0x4
#define _RD7PPS_RD7PPS3_POSN                                0x3
#define _RD7PPS_RD7PPS3_POSITION                            0x3
#define _RD7PPS_RD7PPS3_SIZE                                0x1
#define _RD7PPS_RD7PPS3_LENGTH                              0x1
#define _RD7PPS_RD7PPS3_MASK                                0x8
#define _RD7PPS_RD7PPS4_POSN                                0x4
#define _RD7PPS_RD7PPS4_POSITION                            0x4
#define _RD7PPS_RD7PPS4_SIZE                                0x1
#define _RD7PPS_RD7PPS4_LENGTH                              0x1
#define _RD7PPS_RD7PPS4_MASK                                0x10
#define _RD7PPS_RD7PPS5_POSN                                0x5
#define _RD7PPS_RD7PPS5_POSITION                            0x5
#define _RD7PPS_RD7PPS5_SIZE                                0x1
#define _RD7PPS_RD7PPS5_LENGTH                              0x1
#define _RD7PPS_RD7PPS5_MASK                                0x20

// Register: RE0PPS
#define RE0PPS RE0PPS
extern volatile unsigned char           RE0PPS              __at(0x1F30);
#ifndef _LIB_BUILD
asm("RE0PPS equ 01F30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0PPS0                :1;
        unsigned RE0PPS1                :1;
        unsigned RE0PPS2                :1;
        unsigned RE0PPS3                :1;
        unsigned RE0PPS4                :1;
        unsigned RE0PPS5                :1;
    };
} RE0PPSbits_t;
extern volatile RE0PPSbits_t RE0PPSbits __at(0x1F30);
// bitfield macros
#define _RE0PPS_RE0PPS0_POSN                                0x0
#define _RE0PPS_RE0PPS0_POSITION                            0x0
#define _RE0PPS_RE0PPS0_SIZE                                0x1
#define _RE0PPS_RE0PPS0_LENGTH                              0x1
#define _RE0PPS_RE0PPS0_MASK                                0x1
#define _RE0PPS_RE0PPS1_POSN                                0x1
#define _RE0PPS_RE0PPS1_POSITION                            0x1
#define _RE0PPS_RE0PPS1_SIZE                                0x1
#define _RE0PPS_RE0PPS1_LENGTH                              0x1
#define _RE0PPS_RE0PPS1_MASK                                0x2
#define _RE0PPS_RE0PPS2_POSN                                0x2
#define _RE0PPS_RE0PPS2_POSITION                            0x2
#define _RE0PPS_RE0PPS2_SIZE                                0x1
#define _RE0PPS_RE0PPS2_LENGTH                              0x1
#define _RE0PPS_RE0PPS2_MASK                                0x4
#define _RE0PPS_RE0PPS3_POSN                                0x3
#define _RE0PPS_RE0PPS3_POSITION                            0x3
#define _RE0PPS_RE0PPS3_SIZE                                0x1
#define _RE0PPS_RE0PPS3_LENGTH                              0x1
#define _RE0PPS_RE0PPS3_MASK                                0x8
#define _RE0PPS_RE0PPS4_POSN                                0x4
#define _RE0PPS_RE0PPS4_POSITION                            0x4
#define _RE0PPS_RE0PPS4_SIZE                                0x1
#define _RE0PPS_RE0PPS4_LENGTH                              0x1
#define _RE0PPS_RE0PPS4_MASK                                0x10
#define _RE0PPS_RE0PPS5_POSN                                0x5
#define _RE0PPS_RE0PPS5_POSITION                            0x5
#define _RE0PPS_RE0PPS5_SIZE                                0x1
#define _RE0PPS_RE0PPS5_LENGTH                              0x1
#define _RE0PPS_RE0PPS5_MASK                                0x20

// Register: RE1PPS
#define RE1PPS RE1PPS
extern volatile unsigned char           RE1PPS              __at(0x1F31);
#ifndef _LIB_BUILD
asm("RE1PPS equ 01F31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE1PPS0                :1;
        unsigned RE1PPS1                :1;
        unsigned RE1PPS2                :1;
        unsigned RE1PPS3                :1;
        unsigned RE1PPS4                :1;
        unsigned RE1PPS5                :1;
    };
} RE1PPSbits_t;
