MikroElektronika/core_packages/PIC/XC8/def/PIC16F19195/mcu.h
extern volatile INLVLDbits_t INLVLDbits __at(0x1F5D);
// bitfield macros
#define _INLVLD_INLVLD0_POSN                                0x0
#define _INLVLD_INLVLD0_POSITION                            0x0
#define _INLVLD_INLVLD0_SIZE                                0x1
#define _INLVLD_INLVLD0_LENGTH                              0x1
#define _INLVLD_INLVLD0_MASK                                0x1
#define _INLVLD_INLVLD1_POSN                                0x1
#define _INLVLD_INLVLD1_POSITION                            0x1
#define _INLVLD_INLVLD1_SIZE                                0x1
#define _INLVLD_INLVLD1_LENGTH                              0x1
#define _INLVLD_INLVLD1_MASK                                0x2
#define _INLVLD_INLVLD2_POSN                                0x2
#define _INLVLD_INLVLD2_POSITION                            0x2
#define _INLVLD_INLVLD2_SIZE                                0x1
#define _INLVLD_INLVLD2_LENGTH                              0x1
#define _INLVLD_INLVLD2_MASK                                0x4
#define _INLVLD_INLVLD3_POSN                                0x3
#define _INLVLD_INLVLD3_POSITION                            0x3
#define _INLVLD_INLVLD3_SIZE                                0x1
#define _INLVLD_INLVLD3_LENGTH                              0x1
#define _INLVLD_INLVLD3_MASK                                0x8
#define _INLVLD_INLVLD4_POSN                                0x4
#define _INLVLD_INLVLD4_POSITION                            0x4
#define _INLVLD_INLVLD4_SIZE                                0x1
#define _INLVLD_INLVLD4_LENGTH                              0x1
#define _INLVLD_INLVLD4_MASK                                0x10
#define _INLVLD_INLVLD5_POSN                                0x5
#define _INLVLD_INLVLD5_POSITION                            0x5
#define _INLVLD_INLVLD5_SIZE                                0x1
#define _INLVLD_INLVLD5_LENGTH                              0x1
#define _INLVLD_INLVLD5_MASK                                0x20
#define _INLVLD_INLVLD6_POSN                                0x6
#define _INLVLD_INLVLD6_POSITION                            0x6
#define _INLVLD_INLVLD6_SIZE                                0x1
#define _INLVLD_INLVLD6_LENGTH                              0x1
#define _INLVLD_INLVLD6_MASK                                0x40
#define _INLVLD_INLVLD7_POSN                                0x7
#define _INLVLD_INLVLD7_POSITION                            0x7
#define _INLVLD_INLVLD7_SIZE                                0x1
#define _INLVLD_INLVLD7_LENGTH                              0x1
#define _INLVLD_INLVLD7_MASK                                0x80

// Register: ANSELE
#define ANSELE ANSELE
extern volatile unsigned char           ANSELE              __at(0x1F64);
#ifndef _LIB_BUILD
asm("ANSELE equ 01F64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSE0                  :1;
        unsigned ANSE1                  :1;
        unsigned                        :1;
        unsigned ANSE3                  :1;
        unsigned ANSE4                  :1;
        unsigned ANSE5                  :1;
        unsigned ANSE6                  :1;
        unsigned ANSE7                  :1;
    };
} ANSELEbits_t;
extern volatile ANSELEbits_t ANSELEbits __at(0x1F64);
// bitfield macros
#define _ANSELE_ANSE0_POSN                                  0x0
#define _ANSELE_ANSE0_POSITION                              0x0
#define _ANSELE_ANSE0_SIZE                                  0x1
#define _ANSELE_ANSE0_LENGTH                                0x1
#define _ANSELE_ANSE0_MASK                                  0x1
#define _ANSELE_ANSE1_POSN                                  0x1
#define _ANSELE_ANSE1_POSITION                              0x1
#define _ANSELE_ANSE1_SIZE                                  0x1
#define _ANSELE_ANSE1_LENGTH                                0x1
#define _ANSELE_ANSE1_MASK                                  0x2
#define _ANSELE_ANSE3_POSN                                  0x3
#define _ANSELE_ANSE3_POSITION                              0x3
#define _ANSELE_ANSE3_SIZE                                  0x1
#define _ANSELE_ANSE3_LENGTH                                0x1
#define _ANSELE_ANSE3_MASK                                  0x8
#define _ANSELE_ANSE4_POSN                                  0x4
#define _ANSELE_ANSE4_POSITION                              0x4
#define _ANSELE_ANSE4_SIZE                                  0x1
#define _ANSELE_ANSE4_LENGTH                                0x1
#define _ANSELE_ANSE4_MASK                                  0x10
#define _ANSELE_ANSE5_POSN                                  0x5
#define _ANSELE_ANSE5_POSITION                              0x5
#define _ANSELE_ANSE5_SIZE                                  0x1
#define _ANSELE_ANSE5_LENGTH                                0x1
#define _ANSELE_ANSE5_MASK                                  0x20
#define _ANSELE_ANSE6_POSN                                  0x6
#define _ANSELE_ANSE6_POSITION                              0x6
#define _ANSELE_ANSE6_SIZE                                  0x1
#define _ANSELE_ANSE6_LENGTH                                0x1
#define _ANSELE_ANSE6_MASK                                  0x40
#define _ANSELE_ANSE7_POSN                                  0x7
#define _ANSELE_ANSE7_POSITION                              0x7
#define _ANSELE_ANSE7_SIZE                                  0x1
#define _ANSELE_ANSE7_LENGTH                                0x1
#define _ANSELE_ANSE7_MASK                                  0x80

// Register: WPUE
#define WPUE WPUE
extern volatile unsigned char           WPUE                __at(0x1F65);
#ifndef _LIB_BUILD
asm("WPUE equ 01F65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUE0                  :1;
        unsigned WPUE1                  :1;
        unsigned                        :1;
        unsigned WPUE3                  :1;
        unsigned WPUE4                  :1;
        unsigned WPUE5                  :1;
        unsigned WPUE6                  :1;
        unsigned WPUE7                  :1;
    };
} WPUEbits_t;
extern volatile WPUEbits_t WPUEbits __at(0x1F65);
// bitfield macros
#define _WPUE_WPUE0_POSN                                    0x0
#define _WPUE_WPUE0_POSITION                                0x0
#define _WPUE_WPUE0_SIZE                                    0x1
#define _WPUE_WPUE0_LENGTH                                  0x1
#define _WPUE_WPUE0_MASK                                    0x1
#define _WPUE_WPUE1_POSN                                    0x1
#define _WPUE_WPUE1_POSITION                                0x1
#define _WPUE_WPUE1_SIZE                                    0x1
#define _WPUE_WPUE1_LENGTH                                  0x1
#define _WPUE_WPUE1_MASK                                    0x2
#define _WPUE_WPUE3_POSN                                    0x3
#define _WPUE_WPUE3_POSITION                                0x3
#define _WPUE_WPUE3_SIZE                                    0x1
#define _WPUE_WPUE3_LENGTH                                  0x1
#define _WPUE_WPUE3_MASK                                    0x8
#define _WPUE_WPUE4_POSN                                    0x4
#define _WPUE_WPUE4_POSITION                                0x4
#define _WPUE_WPUE4_SIZE                                    0x1
#define _WPUE_WPUE4_LENGTH                                  0x1
#define _WPUE_WPUE4_MASK                                    0x10
#define _WPUE_WPUE5_POSN                                    0x5
#define _WPUE_WPUE5_POSITION                                0x5
#define _WPUE_WPUE5_SIZE                                    0x1
#define _WPUE_WPUE5_LENGTH                                  0x1
#define _WPUE_WPUE5_MASK                                    0x20
#define _WPUE_WPUE6_POSN                                    0x6
#define _WPUE_WPUE6_POSITION                                0x6
#define _WPUE_WPUE6_SIZE                                    0x1
#define _WPUE_WPUE6_LENGTH                                  0x1
#define _WPUE_WPUE6_MASK                                    0x40
#define _WPUE_WPUE7_POSN                                    0x7
#define _WPUE_WPUE7_POSITION                                0x7
#define _WPUE_WPUE7_SIZE                                    0x1
#define _WPUE_WPUE7_LENGTH                                  0x1
#define _WPUE_WPUE7_MASK                                    0x80

// Register: ODCONE
#define ODCONE ODCONE
extern volatile unsigned char           ODCONE              __at(0x1F66);
#ifndef _LIB_BUILD
asm("ODCONE equ 01F66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCE0                  :1;
        unsigned ODCE1                  :1;
        unsigned                        :1;
        unsigned ODCE3                  :1;
        unsigned ODCE4                  :1;
        unsigned ODCE5                  :1;
        unsigned ODCE6                  :1;
        unsigned ODCE7                  :1;
    };
} ODCONEbits_t;
